docs/ERRORS.org
#+TITLE: JSEC Error Reference
#+AUTHOR: JSEC Project
#+OPTIONS: toc:nil ^:nil

* Overview

This document catalogs all errors that JSEC can produce, organized by module and category.

** Error Format

All errors follow a standardized format:

#+begin_example
[MODULE:CATEGORY] message: detail
#+end_example

Where:
- *MODULE*: TLS, DTLS, CRYPTO, CA, CERT, UTILS
- *CATEGORY*: CONFIG, IO, SSL, SOCKET, PARAM, RESOURCE, VERIFY, PARSE

** Example Errors

#+begin_example
[TLS:CONFIG] invalid cipher suite: RC4-MD5
[DTLS:SOCKET] bind failed: address already in use
[CRYPTO:PARAM] output length must be 1-1024, got 2000
[CA:SSL] failed to sign certificate: key mismatch
#+end_example

* TLS Module Errors

** CONFIG - Configuration Errors

*** ~[TLS:CONFIG] buffer-size must be a number~

*When*: Non-numeric ~:buffer-size~ option
*Fix*: Pass a positive integer

#+begin_src janet
# Wrong
(tls/connect "host" "443" {:buffer-size "big"})

# Correct
(tls/connect "host" "443" {:buffer-size 16384})
#+end_src

*** ~[TLS:CONFIG] invalid cipher suite: <suite>~

*When*: Unrecognized or disabled cipher suite specified
*Fix*: Use valid OpenSSL cipher string

*** ~[TLS:CONFIG] sni option must be a table or struct~

*When*: Invalid ~:sni~ option format for server context
*Fix*: Pass table mapping hostnames to cert/key configs

#+begin_src janet
{:sni {"api.example.com" {:cert api-cert :key api-key}
       "www.example.com" {:cert www-cert :key www-key}}}
#+end_src

*** ~[TLS:CONFIG] Invalid ALPN protocols~

*When*: Invalid ~:alpn~ option format
*Fix*: Pass array of protocol strings

#+begin_src janet
{:alpn ["h2" "http/1.1"]}
#+end_src

*** ~[TLS:CONFIG] handler function must take at least 1 argument~

*When*: Server handler function has wrong arity
*Fix*: Handler must accept at least the stream argument

#+begin_src janet
# Wrong
(tls/server "0.0.0.0" "8443" (fn [] (print "no args")) opts)

# Correct
(tls/server "0.0.0.0" "8443" (fn [stream] (:close stream)) opts)
#+end_src

** PARAM - Parameter Errors

*** ~[TLS:PARAM] timeout must be non-negative, got <value>~

*When*: Passing negative timeout value to I/O operations
*Fix*: Use zero or positive timeout (seconds)

#+begin_src janet
# Wrong
(:read stream -1)

# Correct
(:read stream 1024 5.0)  # 5 second timeout
#+end_src

*** ~[TLS:PARAM] expected keyword or nil, got <value>~

*When*: Passing wrong type to ~:close~ method
*Fix*: Pass ~:r~, ~:w~, ~:rw~, or ~nil~

#+begin_src janet
# Wrong
(:close stream "both")

# Correct
(:close stream :rw)  # Close both directions
(:close stream)      # Same as :rw
#+end_src

*** ~[TLS:PARAM] length must be non-negative~

*When*: Negative length to read operations
*Fix*: Pass zero or positive length

** IO - I/O Errors

*** ~[TLS:IO] stream is closed~

*When*: I/O on a closed TLS stream
*Fix*: Don't use stream after closing

#+begin_src janet
(def stream (tls/connect "host" "443"))
(:close stream)
(:read stream 1024)  # Error! Stream is closed
#+end_src

*** ~[TLS:IO] connection is shutting down~

*When*: Write attempt during TLS shutdown
*Fix*: Complete shutdown before further operations

** SSL - OpenSSL Errors

*** ~[TLS:SSL] failed to create SSL context: <ssl-error>~

*When*: SSL_CTX_new() failed
*Fix*: Check OpenSSL installation, memory

*** ~[TLS:SSL] failed to create SSL object: <ssl-error>~

*When*: SSL_new() failed
*Fix*: Check context validity, memory

*** ~[TLS:SSL] handshake failed: <ssl-error>~

*When*: TLS handshake failed
*Fix*: Check certificates, protocol compatibility

*** ~[TLS:SSL] certificate verification failed: <ssl-error>~

*When*: Peer certificate verification failed
*Fix*: Check certificate chain, CA trust

*** ~[TLS:SSL] failed to load private key: <ssl-error>~

*When*: Private key PEM parsing failed
*Fix*: Verify key format, check for corruption

*** ~[TLS:SSL] failed to load certificate: <ssl-error>~

*When*: Certificate PEM parsing failed
*Fix*: Verify certificate format

*** ~[TLS:SSL] private key does not match certificate: <ssl-error>~

*When*: Certificate/key mismatch in server config
*Fix*: Ensure cert and key are a matching pair

** SOCKET - Socket Errors

*** ~[TLS:SOCKET] could not connect to <host>:<port>: <errno>~

*When*: TCP connection failed
*Fix*: Check host/port, firewall, server status

*** ~[TLS:SOCKET] bind failed: <errno>~

*When*: Server bind failed
*Fix*: Check port availability, permissions

*** ~[TLS:SOCKET] listen failed: <errno>~

*When*: Socket listen() failed
*Fix*: Check socket state

