docs/ERRORS.org
** Using protect/try

#+begin_src janet
(def result
  (protect
    (tls/connect "untrusted.example.com" "443" {:verify true})))

(if (nil? result)
  (print "Connection failed - check certificate")
  (do-something-with result))
#+end_src

** Checking Return Values

Many functions return ~nil~ on failure:

#+begin_src janet
(when-let [stream (tls/connect host port opts)]
  (defer (:close stream)
    (process-stream stream)))
#+end_src

** Timeouts

Always use timeouts for network operations:

#+begin_src janet
(def data (:read stream 1024 30.0))  # 30 second timeout
(when (nil? data)
  (print "Read timed out or connection closed"))
#+end_src

* Testing Error Conditions

To test that your code handles errors correctly, use janet-assay's
~:expected-fail~ feature for negative testing:

#+begin_src janet
(import assay)

(assay/def-suite "error-handling"
  (assay/def-test "rejects invalid iterations"
    :expected-fail "[CRYPTO:PARAM]"
    (crypto/pbkdf2 :sha256 "password" "salt" 0 32)))
#+end_src

* See Also

- [[file:API.org][API Reference]] - Complete function documentation
- [[file:GUIDE.org][User Guide]] - Getting started and examples
- [[file:DEVELOPERS.org][Developer Guide]] - Contributing and internals